#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
# sweets = {
    # 'название сладости': [
        # {'shop': 'название магазина', 'price': 99.99},
        # TODO тут с клавиатуры введите магазины и цены (можно копипастить ;)
    # ],
    # TODO тут с клавиатуры введите другую сладость и далее словарь магазинов
# }

sweets={
    'печенье':[
        {'shop':'ашан', 'price': 10.99},
        {'shop':'пятёрочка', 'price': 9.99},
        {'shop':'магнит', 'price': 11.99}],
    'конфеты':[
        {'shop':'ашан', 'price': 34.99},
        {'shop':'пятёрочка', 'price': 32.99},
        {'shop':'магнит', 'price': 30.99}],
    'карамель':[
        {'shop':'ашан', 'price': 45.99},
        {'shop':'пятёрочка', 'price': 46.99},
        {'shop':'магнит', 'price': 41.99}],
    'пирожное':[
        {'shop':'ашан', 'price': 67.99},
        {'shop':'пятёрочка', 'price': 59.99},
        {'shop':'магнит', 'price': 62.99}]
}

# Указать надо только по 2 магазина с минимальными ценами

for key_sw in sweets.items():
    min1=9999
    min2=9999
    nam1='error'
    nam2='error'
    for i in range(2):
        for key_as in key_sw[1]:
            if((key_as['price']<min1)):
                min1=key_as['price']
                nam1=key_as['shop']
            elif(key_as['price']<min2 and (key_as['shop']!=nam1)):
                min2=key_as['price']
                nam2=key_as['shop']
    print(key_sw[0], nam1, nam2)
